-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2018-08-10 09:49:14
-- 服务器版本： 5.6.17-log
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `mhvfnklmlqefsxgwwyvc`
--

-- --------------------------------------------------------

--
-- 表的结构 `goods`
--

CREATE TABLE IF NOT EXISTS `goods` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `img` varchar(1000) NOT NULL,
  `price` float(5,1) NOT NULL DEFAULT '0.0',
  `unit` char(100) NOT NULL DEFAULT '瓶',
  `hot` int(10) NOT NULL DEFAULT '1',
  `count` int(10) NOT NULL DEFAULT '0',
  `cid` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- 转存表中的数据 `goods`
--

INSERT INTO `goods` (`id`, `name`, `img`, `price`, `unit`, `hot`, `count`, `cid`) VALUES
(2, 'MDHUX威士忌', '/uploadfile/13.png', 22.5, '瓶', 2, 0, 0),
(3, 'OKDUN可乐', '/uploadfile/12.png', 6.5, '瓶', 4, 0, 0),
(4, 'SIFPAK薯片', '/uploadfile/15.png', 9.5, '袋', 1, 0, 1),
(5, 'TFIKO软糖', '/uploadfile/14.png', 10.0, '袋', 5, 0, 1),
(6, 'KVNDU啤酒', '/uploadfile/10.png', 12.5, '瓶', 3, 0, 0),
(7, 'MDHUX威士忌', '/uploadfile/13.png', 22.5, '瓶', 2, 0, 0),
(8, 'OKDUN可乐', '/uploadfile/12.png', 6.5, '瓶', 4, 0, 0),
(9, 'SIFPAK薯片', '/uploadfile/15.png', 9.5, '袋', 1, 0, 1),
(10, 'TFIKO软糖', '/uploadfile/14.png', 10.0, '袋', 5, 0, 1),
(13, 'OKDUN可乐', '/uploadfile/12.png', 6.5, '瓶', 4, 0, 0),
(14, 'SIFPAK薯片', '/uploadfile/15.png', 9.5, '袋', 1, 0, 1),
(15, 'TFIKO软糖', '/uploadfile/14.png', 10.0, '袋', 5, 0, 1),
(16, 'KVNDU啤酒', '/uploadfile/10.png', 12.5, '瓶', 3, 0, 0),
(17, 'MDHUX威士忌', '/uploadfile/13.png', 22.5, '瓶', 2, 0, 0),
(18, 'OKDUN可乐', '/uploadfile/12.png', 6.5, '瓶', 4, 0, 0),
(19, 'SIFPAK薯片', '/uploadfile/15.png', 9.5, '袋', 1, 0, 1),
(20, 'TFIKO软糖', '/uploadfile/14.png', 10.0, '袋', 5, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `guess`
--

CREATE TABLE IF NOT EXISTS `guess` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question` text NOT NULL,
  `answer` varchar(255) NOT NULL,
  `typeid` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- 转存表中的数据 `guess`
--

INSERT INTO `guess` (`id`, `question`, `answer`, `typeid`) VALUES
(1, '既来之，则安之 （打一字）', '兔\r\n小贴士：“兔”字来了“之”，就是“逸”字。“逸”即“安逸”。', 0),
(2, '云长啊云长 （打一成语）', '一语双关\r\n谜底中的“关”别指“关羽”，关羽字云长', 0),
(3, '英国人说再见，中国人行个礼。 （打一字）', '拜\r\n小贴士：“拜”一义为再见（bye），另一义表示恭敬。', 0),
(4, '媳妇走后每称孤 （打二字神话人物）', '嫦娥\r\n小贴士：“媳妇”二字的后半部分走后，剩下“女女”；“每”与“常”的字义相扣；“孤”是帝王的自称，与“我”之意相通。', 0),
(5, '悟空扣门八戒开 （打俗语五字）', '里外不是人\r\n小贴士：“里外”别解为“屋里屋外”，无论是屋里的八戒还是屋外的悟空都不是人。', 0),
(6, '如此口角，似有醉声。 （打一字）', '嘴\r\n小贴士：如果“此口角”组合在一起，就是“嘴”字；“嘴”与“醉”读音相似。', 0),
(7, '远离二奶小三 （打一成语，掉尾格）', '不近人情\r\n小贴士：灯谜中“掉尾格”规定，谜底必须三个字以上，末端两个字互换位置来读才能与谜面相扣，故本条谜底读作“不近情人”。', 0),
(8, '宋字不戴帽，不能猜作木。 （打一字）', '李\r\n小贴士：“宋字”二字不戴“帽”，余下“木子”。', 0),
(9, '潘金莲暗中勾结西门庆 （打一成语）', '大难临头', 0),
(10, '杀之儆猴效未奏 （打一菜肴名）', '白斩鸡\r\n小贴士：谜面中的“之”作代词使用，因有成语“杀鸡儆猴”，故以“之”代替“鸡”；“效未奏”即“白斩”了。相传猴子是最怕见血的，驯猴的人首先当面把鸡杀给它看，叫它看看血的厉害，才可以逐步进行教化。', 0),
(11, '/uploadfile/1.png', '鱼贯而入', 1),
(12, '/uploadfile/2.png', '网开一面', 1),
(13, '/uploadfile/3.png', '穷困潦倒', 1),
(14, '/uploadfile/4.png', '普天同庆', 1),
(15, '/uploadfile/5.png', '弹尽粮绝', 1),
(16, '/uploadfile/6.png', '风花雪月', 1),
(17, '/uploadfile/7.png', '重蹈覆辙', 1),
(18, '/uploadfile/8.png', '日行千里', 1),
(19, '/uploadfile/9.png', '独当一面', 1),
(20, '/uploadfile/16.png', '轰轰烈烈', 1);

-- --------------------------------------------------------

--
-- 表的结构 `orders`
--

CREATE TABLE IF NOT EXISTS `orders` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `gid` int(10) NOT NULL,
  `count` int(255) NOT NULL,
  `oid` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=126 ;

--
-- 转存表中的数据 `orders`
--

INSERT INTO `orders` (`id`, `gid`, `count`, `oid`) VALUES
(49, 1, 3, 4),
(50, 2, 2, 4),
(51, 2, 3, 5),
(52, 4, 4, 5),
(53, 5, 3, 5),
(54, 14, 1, 5),
(55, 2, 2, 9),
(56, 4, 2, 9),
(57, 5, 2, 9),
(58, 2, 2, 10),
(59, 4, 1, 10),
(60, 5, 2, 10),
(61, 4, 2, 11),
(62, 5, 2, 11),
(63, 2, 1, 12),
(64, 3, 1, 12),
(65, 2, 1, 13),
(66, 3, 1, 13),
(67, 2, 2, 14),
(68, 3, 2, 14),
(69, 2, 5, 15),
(70, 3, 5, 15),
(71, 5, 1, 16),
(72, 3, 1, 17),
(73, 2, 2, 18),
(74, 3, 1, 18),
(75, 6, 1, 18),
(76, 2, 1, 19),
(77, 3, 1, 19),
(78, 16, 1, 20),
(79, 17, 4, 20),
(80, 18, 1, 20),
(81, 2, 1, 21),
(82, 3, 1, 21),
(83, 4, 3, 21),
(84, 5, 1, 21),
(85, 6, 1, 21),
(86, 9, 1, 21),
(87, 2, 4, 22),
(88, 8, 1, 23),
(89, 13, 1, 23),
(90, 16, 1, 23),
(91, 2, 1, 24),
(92, 3, 1, 24),
(93, 4, 1, 24),
(94, 5, 1, 24),
(95, 6, 1, 24),
(96, 7, 2, 24),
(97, 13, 1, 24),
(98, 2, 1, 25),
(99, 3, 1, 26),
(100, 19, 6, 27),
(101, 2, 2, 28),
(102, 3, 2, 28),
(103, 4, 2, 28),
(104, 5, 2, 28),
(105, 6, 1, 28),
(106, 14, 3, 28),
(107, 2, 1, 29),
(108, 3, 1, 29),
(109, 6, 1, 29),
(110, 2, 2, 30),
(111, 3, 3, 30),
(112, 4, 2, 30),
(113, 5, 2, 30),
(114, 6, 1, 30),
(115, 2, 1, 31),
(116, 3, 1, 31),
(117, 6, 1, 31),
(118, 20, 2, 31),
(119, 2, 3, 32),
(120, 3, 2, 32),
(121, 4, 3, 32),
(122, 5, 2, 32),
(123, 6, 3, 32),
(124, 2, 1, 33),
(125, 4, 1, 33);

-- --------------------------------------------------------

--
-- 表的结构 `order_goods`
--

CREATE TABLE IF NOT EXISTS `order_goods` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `tell` char(11) NOT NULL,
  `room` int(10) NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `status` tinyint(4) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=34 ;

--
-- 转存表中的数据 `order_goods`
--

INSERT INTO `order_goods` (`id`, `tell`, `room`, `time`, `status`) VALUES
(4, '1234567890', 1706, '2017-11-09 15:31:29', 0),
(5, '1234567890', 1706, '2017-11-09 15:46:53', 0),
(9, '1234567890', 1706, '2017-12-08 03:06:02', 0),
(10, '1234567890', 1706, '2017-12-08 05:21:08', 0),
(11, '1234567890', 1706, '2017-12-08 05:21:37', 0),
(12, '1234567890', 1706, '2017-12-08 05:23:17', 0),
(13, '1234567890', 1706, '2017-12-08 05:23:34', 0),
(14, '1234567890', 1706, '2017-12-08 07:15:05', 0),
(15, '1234567890', 1706, '2017-12-08 07:15:21', 0),
(16, '1234567890', 1706, '2017-12-10 07:21:51', 0),
(17, '1234567890', 1706, '2017-12-12 05:49:20', 0),
(18, '1234567890', 1706, '2017-12-15 08:08:53', 0),
(19, '1234567890', 1706, '2017-12-15 08:09:13', 0),
(20, '1234567890', 1706, '2018-02-18 18:57:16', 0),
(21, '1234567890', 1706, '2018-02-25 07:01:49', 0),
(22, '1234567890', 1706, '2018-02-26 16:39:38', 0),
(23, '1234567890', 1706, '2018-02-26 18:07:31', 0),
(24, '1234567890', 1706, '2018-02-27 11:38:55', 0),
(25, '1234567890', 1706, '2018-03-05 02:32:34', 0),
(26, '1234567890', 1706, '2018-03-10 12:23:44', 0),
(27, '15110334322', 1706, '2018-04-01 02:22:42', 0),
(28, '1234567890', 1706, '2018-05-21 13:35:42', 0),
(29, '1234567890', 1706, '2018-05-21 13:36:25', 0),
(30, '1234567890', 1706, '2018-05-23 15:45:14', 0),
(31, '1234567890', 1706, '2018-05-24 03:01:24', 0),
(32, '1234567890', 1706, '2018-05-24 08:23:58', 0),
(33, '1234567890', 1706, '2018-05-25 03:33:37', 0);

-- --------------------------------------------------------

--
-- 表的结构 `risk`
--

CREATE TABLE IF NOT EXISTS `risk` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `content` varchar(200) NOT NULL,
  `status` int(1) NOT NULL DEFAULT '0',
  `typeid` int(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=37 ;

--
-- 转存表中的数据 `risk`
--

INSERT INTO `risk` (`id`, `content`, `status`, `typeid`) VALUES
(1, '和男/女朋友进行到哪一步了', 0, 0),
(2, '最喜欢在座哪位异性', 0, 0),
(3, '内衣/裤颜色（这个，如果不太熟要慎用啊~）', 0, 0),
(4, '身上哪个部位最敏感', 0, 0),
(5, '如果有来生，你选择当？', 0, 0),
(6, '最欣赏自己哪个部位？对自己那个部位最不满意？', 0, 0),
(7, '如果让你kiss现场的某一位异性，你会选择谁，为什么？', 0, 0),
(8, '和多少异性有过非恋爱的暧昧关系？', 0, 0),
(9, '结婚后希望生男孩还是女孩(只能选择一个，说出原因)。', 0, 0),
(10, '第一次爱的人对你有什么影响？', 0, 0),
(11, '在现场所有同学中，你看哪位异性同学最舒服？', 0, 0),
(12, '你吻过几个人？', 0, 0),
(13, '你的初恋对象是谁? ', 0, 0),
(14, '你的初吻是几岁在什么地方被什么人夺去的?', 0, 0),
(15, ' 你对左边第三个异性有什么感觉？要具体。', 0, 0),
(16, ' 情人节最想收到什么礼物？', 0, 0),
(17, '你觉得在座最帅或最漂亮的人是谁？', 0, 0),
(18, '洗澡洗到一半没水了怎么办？（注意是身上有泡沫的时候）', 0, 0),
(19, '对着离你最近的异性的耳根敏感部位哈气，持续5秒', 0, 1),
(20, ' 女生靠在墙上，男生撑在上面，做五下俯卧撑；（脸对脸）', 0, 1),
(21, ' 男生靠在墙上，女生撑在上面，坚持5秒钟；（脸对脸）', 0, 1),
(22, ' 直接互亲嘴角（注意是互亲）', 0, 1),
(23, ' 两只手贴着异性的脸，双眼对视一轮', 0, 1),
(24, ' 选两位异性用嘴唇传纸牌', 0, 1),
(25, ' 男生从女生腰背后双手摸过搂住女生的腰，下巴放在女生肩上，坚持5秒', 0, 1),
(26, ' 碰胸（撞上去）', 0, 1),
(27, ' 选一位异性，互摸嘴唇', 0, 1),
(28, ' 坐在异性大腿上坚持10秒', 0, 1),
(29, '找一位你觉得在场最帅或最漂亮的一位异性合照', 0, 1),
(30, ' 男生弹女生内衣大带 两边各一下', 0, 1),
(31, ' 互亲异性耳垂', 0, 1),
(32, ' 与一位身高差不多的异性紧紧的抱5秒，脸必须搭在对方身上', 0, 1),
(33, '选一位异性，由对方决定亲那里，不能是手', 0, 1),
(34, ' 拜托一个男生和一个女生紧紧的抱在一起坚持五秒钟。（要是失败了的话，就自己上）', 0, 1),
(35, '男的靠在女的肚子上：老婆 几个月了 （男生选女生）要温柔的说', 0, 1),
(36, ' 男生松掉女生bra带 ', 0, 1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
